c5/src/Documents/EmployeesTransfer/EmployeesTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>EmployeesTransfer</name>
  <registerRecords>InformationRegister.Personnel</registerRecords>
  <registerRecords>InformationRegister.EmployeeRates</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Additions</name>
    <attributes>
      <name>Action</name>
      <type>
        <types>EnumRef.Changes</types>
      </type>
    </attributes>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Employees</name>
    <attributes>
      <name>Action</name>
      <type>
        <types>EnumRef.Changes</types>
      </type>
    </attributes>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.Positions</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.Schedules</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/InformationRegisters/EmployeeRates/EmployeeRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EmployeeRates</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Actual</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </resources>
  <resources>
    <name>InHand</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Compensation</name>
    <type>
      <types>ChartOfCalculationTypesRef.Compensations</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/Calculations/Calculations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Calculations</name>
  <enumValues>
    <name>Absence</name>
  </enumValues>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Annual</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>ChildCare</name>
  </enumValues>
  <enumValues>
    <name>CompensationPercent</name>
  </enumValues>
  <enumValues>
    <name>DailyPercent</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>EveningHours</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>ExtraChildCare</name>
  </enumValues>
  <enumValues>
    <name>FixedAmount</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>HolidayHours</name>
  </enumValues>
  <enumValues>
    <name>HourlyRate</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsurance</name>
  </enumValues>
  <enumValues>
    <name>MonthlyRate</name>
  </enumValues>
  <enumValues>
    <name>NightHours</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>PaternityVacation</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>SickDays</name>
  </enumValues>
  <enumValues>
    <name>SickDaysChild</name>
  </enumValues>
  <enumValues>
    <name>SickOnlySocial</name>
  </enumValues>
  <enumValues>
    <name>SickProduction</name>
  </enumValues>
  <enumValues>
    <name>SocialInsurance</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>VacationWithoutPay</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Changes/Changes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Changes</name>
  <enumValues>
    <name>Add</name>
  </enumValues>
  <enumValues>
    <name>Change</name>
  </enumValues>
  <enumValues>
    <name>Remove</name>
  </enumValues>
  <enumValues>
    <name>Nothing</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/EmployeesTransfer/Forms/Row/Module.bsl
&AtClient
var TableRow export;
&AtServer
var TableRow;
&AtServer
var Data;
&AtClient
var AdditionsRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	loadParams ();
	Options.Company ( ThisObject, Object.Company );
	
EndProcedure

&AtServer
Procedure init ()
	
	Currency = Application.Currency ();

EndProcedure 

&AtServer
Procedure loadParams ()
	
	Object.Company = Parameters.Company;
	
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	loadData ();
	
EndProcedure

&AtClient
Procedure loadData ()
	
	owner = FormOwner.Object;
	Object.Date = owner.Date;
	TableRow = Object.Employees.Add ();
	FillPropertyValues ( TableRow, FormOwner.Items.Employees.CurrentData );
	if ( Parameters.NewRow ) then
		TableRow.Date = Object.Date;
	else
		table = Object.Additions;
		rows = owner.Additions.FindRows ( new Structure ( "Employee", TableRow.Employee ) );
		for each row in rows do
			newRow = table.Add ();
			FillPropertyValues ( newRow, row );
		enddo; 
	endif; 
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	HiringRowForm.OK ( ThisObject );
	
EndProcedure

&AtClient
Procedure EmployeeOnChange ( Item )
	
	if ( TableRow.Employee.IsEmpty () ) then
		return;
	endif; 
	readData ();
	
EndProcedure

&AtServer
Procedure readData ()
	
	TableRow = Object.Employees [ 0 ];
	getData ();
	readLocation ();
	readCompensations ();

EndProcedure 

&AtServer
Procedure getData ()
	
	s = "
	|// Location
	|select Personnel.Department as Department, Personnel.Expenses as Expenses, Personnel.Position as Position,
	|	Personnel.Schedule as Schedule, Employee.Individual as Individual
	|from InformationRegister.Personnel.SliceLast ( , Employee = &Employee ) as Personnel
	|;
	|// Compensations
	|select Rates.Compensation as Compensation, Rates.Currency as Currency, Rates.Rate as Rate,
	|	case
	|		when Rates.Compensation.Method in (
	|			value ( Enum.Calculations.HourlyRate ),
	|			value ( Enum.Calculations.MonthlyRate )
	|			)
	|		then true
	|		else false
	|	end as Main
	|from InformationRegister.EmployeeRates.SliceLast ( , Employee = &Employee ) as Rates
	|where Rates.Actual
	|";
	q = new Query ( s );
	q.SetParameter ( "Employee", TableRow.Employee );
	result = q.ExecuteBatch ();
	Data = new Structure ();
	Data.Insert ( "Location", result [ 0 ].Unload () );
	Data.Insert ( "Compensations", result [ 1 ].Unload () );

EndProcedure

&AtServer
Procedure readLocation ()
	
	location = Data.Location;
	if ( location.Count () = 0 ) then
		return;
	endif; 
	FillPropertyValues ( TableRow, location [ 0 ] );
	
EndProcedure 

&AtServer
Procedure readCompensations ()
	
	employee = TableRow.Employee;
	additions = Object.Additions;
	date = Object.Date;
	additions.Clear ();
	for each row in Data.Compensations do
		if ( row.Main ) then
			FillPropertyValues ( TableRow, row );
			TableRow.Action = Enums.Changes.Nothing;
		else
			addon = additions.Add ();
			FillPropertyValues ( addon, row );
			addon.Employee = employee;
			addon.Action = Enums.Changes.Nothing;
			addon.Date = date;
		endif; 
	enddo; 
	
EndProcedure 

&AtClient
Procedure FieldOnChange ( Item )
	
	resetAction ( TableRow );

EndProcedure

&AtClient
Procedure resetAction ( Source )
	
	if ( Source.Action = PredefinedValue ( "Enum.Changes.Nothing" ) ) then
		Source.Action = PredefinedValue ( "Enum.Changes.Change" );
	endif; 
	
EndProcedure 

// *****************************************
// *********** Table Additions

&AtClient
Procedure ObjectAdditionsOnActivateRow ( Item )
	
	AdditionsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ObjectAdditionsOnStartEdit ( Item, NewRow, Clone )
	
	if ( NewRow and not Clone ) then
		initAddition ();
	endif; 
	
EndProcedure

&AtClient
Procedure initAddition ()
	
	AdditionsRow.Currency = Currency;
	AdditionsRow.Date = Object.Date;
	
EndProcedure 

&AtClient
Procedure ObjectAdditionsFieldOnChange ( Item )
	
	resetAction ( AdditionsRow );
	
EndProcedure
